AvansMechatronica/ai-voice-control/esp32/firmware/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <driver/i2s.h>
#include <esp_idf_version.h>
#include <esp_task_wdt.h>
#include "I2SMicSampler.h"
#include "CommandDetector.h"
#include "CommandProcessor.h"
#include "config.h"


// This task does all the heavy lifting for our application
void applicationTask(void *param)
{
  CommandDetector *commandDetector = static_cast<CommandDetector *>(param);

  const TickType_t xMaxBlockTime = pdMS_TO_TICKS(100);
  while (true)
  {
    // wait for some audio samples to arrive
    uint32_t ulNotificationValue = ulTaskNotifyTake(pdTRUE, xMaxBlockTime);
    if (ulNotificationValue > 0)
    {
      commandDetector->run();
      vTaskDelay(pdMS_TO_TICKS(1));
    }
  }
}

void setup()
{
  Serial.begin(115200);
  delay(1000);
  Serial.println("Starting up");

  // make sure we don't get killed for our long running tasks
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t wdt_config = {
    .timeout_ms = 10000,
    .idle_core_mask = 0,
    .trigger_panic = false,
  };
  esp_task_wdt_init(&wdt_config);
#else
  esp_task_wdt_init(10, false);
#endif

  // start up the I2S input (from either an I2S microphone or Analogue microphone via the ADC)
  // Direct i2s input from INMP441 or the SPH0645
  I2SSampler *i2s_sampler = new I2SMicSampler(pin_config, false);
  // the command processor
  CommandProcessor *command_processor = new CommandProcessor();

  // create our application
  CommandDetector *commandDetector = new CommandDetector(i2s_sampler, command_processor);

  // set up the i2s sample writer task
  TaskHandle_t applicationTaskHandle;
  xTaskCreatePinnedToCore(applicationTask, "Command Detect", 8192, commandDetector, 1, &applicationTaskHandle, 0);

  // start sampling from i2s device - use I2S_NUM_0 as that's the one that supports the internal ADC
  i2s_sampler->start(I2S_NUM_0, i2s_config, applicationTaskHandle);

  
}

void loop()
{
  vTaskDelay(pdMS_TO_TICKS(1000));
}